In [73]:
# Dependencies and Setup
import pandas as pd

In [74]:
# Save File path to variable
purchase_csv = "Resources/purchase_data.csv"

In [75]:
# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(purchase_csv)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [125]:
# Display total number of players
total_players_df = purchase_df[["SN","Gender","Age","Purchase ID","Price"]].drop_duplicates()
print(len(total_players_df))
total_players_df.head()
# total_players_df = pd.DataFrame({"Total PLayers":[576]})

780

              SN Gender  Age  Purchase ID  Price
0        Lisim78   Male   20            0   3.53
1    Lisovynya38   Male   40            1   1.56
2     Ithergue48   Male   24            2   4.88
3  Chamassasya86   Male   24            3   3.27
4      Iskosia90   Male   23            4   1.44

In [126]:
# Data Frame to display total players
total_players_summary = pd.DataFrame({"Total PLayers":[576]})
total_players_summary

   Total PLayers
0            576

In [127]:
# Run basic calculations to obtain number of unique items, average price, etc.
# Create a summary data frame to hold the results
# Display the summary data frame

unique_items = len(purchase_df["Item Name"].unique())
unique_items

179

In [128]:
average_price = purchase_df["Price"].mean()
average_price

3.050987179487176

In [129]:
number_purchases = purchase_df["Purchase ID"].count()
number_purchases

780

In [130]:
Total_Revenue = purchase_df["Price"].sum()
Total_Revenue

2379.77

In [131]:
# Create a summary data frame to hold the results
summary_df = pd.DataFrame({"Number of Purchases":[780], "Average Price":[3.05],"Unique Items":[179],"Total Revenue":[2379]})
summary_df

   Number of Purchases  Average Price  Unique Items  Total Revenue
0                  780           3.05           179           2379

In [132]:
# Count of Male,Female, and Other/Non-Disclosed Players
gender_count_df = pd.DataFrame(total_players_df["Gender"].value_counts())
gender_count_df.head()

                       Gender
Male                      652
Female                    113
Other / Non-Disclosed      15

In [135]:
# Percentage of Male, Female, and Other/Non-Disclosed Players

total_players = len(total_players_df)
players_by_gender = gender_count_df.groupby(["Gender"]).count()
gender_percent_df = gender_count_df / total_players *100
gender_percent_df

                          Gender
Male                   83.589744
Female                 14.487179
Other / Non-Disclosed   1.923077

In [136]:
# New Data Frame with Total Count and Percentage of Players by Gender

New_gender_df = pd.DataFrame({"Total Count":[484,81,11],"Percentage of Players":[84.03,14.06,1.91]})
New_gender_df

   Total Count  Percentage of Players
0          484                  84.03
1           81                  14.06
2           11                   1.91

In [137]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame

average_price = purchase_df.groupby("Gender")["Price"].mean()
average_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [138]:
number_purchases = purchase_df.groupby("Gender")["Purchase ID"].count()
number_purchases

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [203]:
total_purchase_value = purchase_df.groupby("Gender")["Price"].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [204]:
average_per_person = purchase_df.groupby("Gender")["Price"].mean()
average_per_person

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [210]:
# Create a summary data frame to hold the results
gender_summary_df = pd.DataFrame({"Purchase Count":[113,652,15],"Average Purchase Price":[3.20,3.01,3.34],
                                  "Total Purchase Value":[361.94,1967.64,50.19],
                                  "Average Per Person":[4.47,4.07,4.56]})
gender_summary_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Per Person
0,113,3.20,361.94,4.47
1,652,3.01,1967.64,4.07
2,15,3.34,50.19,4.56

In [142]:
#Establish bins for ages
#Categorize the existing players using the age bins. Hint: use pd.cut()
#Calculate the numbers and percentages by age group
#Create a summary data frame to hold the results
#Display Age Demographics Table

In [143]:
# Figure out minimum and maximum ages
print(purchase_df["Age"].max())
print(purchase_df["Age"].min())

45
7

In [144]:
# Create bins in which to place values based upon Age
bins = [0,10,15,20,25,30,35,40,45]

# Create labels for these bins
group_lables = ["0 to 9","10 to 14","15 to 19", "20 to 24","25 to 29","30 to 34","35 to 39","40 to 45"]
group_lables

['0 to 9',
 '10 to 14',
 '15 to 19',
 '20 to 24',
 '25 to 29',
 '30 to 34',
 '35 to 39',
 '40 to 45']

In [145]:
# Slice the data and place it into bins
print(total_players_df)

total_players_df["age ranges"] = pd.cut(total_players_df["Age"], bins, labels=group_lables)
age_totals = total_players_df["age ranges"].value_counts()
print(age_totals)

                SN  Gender  Age  Purchase ID  Price
0          Lisim78    Male   20            0   3.53
1      Lisovynya38    Male   40            1   1.56
2       Ithergue48    Male   24            2   4.88
3    Chamassasya86    Male   24            3   3.27
4        Iskosia90    Male   23            4   1.44
..             ...     ...  ...          ...    ...
775     Aethedru70  Female   21          775   3.54
776         Iral74    Male   21          776   1.63
777     Yathecal72    Male   20          777   3.46
778        Sisur91    Male    7          778   4.19
779      Ennrian78    Male   24          779   4.60

[780 rows x 5 columns]
20 to 24    325
15 to 19    200
25 to 29     77
10 to 14     54
30 to 34     52
35 to 39     33
0 to 9       32
40 to 45      7
Name: age ranges, dtype: int64

In [146]:
# Age dataframe
age_demo = pd.DataFrame({"Total by age range":age_totals,"Percent total of players": age_totals/total_players})
age_demo.sort_index()

          Total by age range  Percent total of players
0 to 9                    32                  0.041026
10 to 14                  54                  0.069231
15 to 19                 200                  0.256410
20 to 24                 325                  0.416667
25 to 29                  77                  0.098718
30 to 34                  52                  0.066667
35 to 39                  33                  0.042308
40 to 45                   7                  0.008974

In [220]:
#Bin the purchase_data data frame by age
purchase_df["age ranges"] = pd.cut(purchase_df["Age"], bins, labels=group_lables)
purchase_totals = purchase_df["age ranges"].value_counts()
purchase_totals

20 to 24    325
15 to 19    200
25 to 29     77
10 to 14     54
30 to 34     52
35 to 39     33
0 to 9       32
40 to 45      7
Name: age ranges, dtype: int64

In [218]:
# Bin the purchase_data data frame by age
print(total_players_df)

total_players_df["age ranges"] = pd.cut(purchase_df["Purchase ID"], bins, labels=group_lables)
purchase_totals = total_players_df["age ranges"].value_counts()
purchase_totals

                SN  Gender  Age  Purchase ID  Price age ranges  \
0          Lisim78    Male   20            0   3.53        NaN
1      Lisovynya38    Male   40            1   1.56     0 to 9
2       Ithergue48    Male   24            2   4.88     0 to 9
3    Chamassasya86    Male   24            3   3.27     0 to 9
4        Iskosia90    Male   23            4   1.44     0 to 9
..             ...     ...  ...          ...    ...        ...
775     Aethedru70  Female   21          775   3.54        NaN
776         Iral74    Male   21          776   1.63        NaN
777     Yathecal72    Male   20          777   3.46        NaN
778        Sisur91    Male    7          778   4.19        NaN
779      Ennrian78    Male   24          779   4.60        NaN

    (age ranges, purchase count) purchase count
0                       15 to 19       15 to 19
1                       35 to 39       35 to 39
2                       20 to 24       20 to 24
3                       20 to 24       20 to 24
4                       20 to 24       20 to 24
..                           ...            ...
775                     20 to 24       20 to 24
776                     20 to 24       20 to 24
777                     15 to 19       15 to 19
778                       0 to 9         0 to 9
779                     20 to 24       20 to 24

[780 rows x 8 columns]

0 to 9      10
40 to 45     5
35 to 39     5
30 to 34     5
25 to 29     5
20 to 24     5
15 to 19     5
10 to 14     5
Name: age ranges, dtype: int64

In [212]:
purchase_demo = pd.DataFrame({"Purchase Count":[],"Average Purchase Price":[],
                             "Total Purchase Value":[],"Average Total Per Person":[]})
purchase_demo.sort_index()

Empty DataFrame
Columns: [Purchase Count, Average Purchase Price, Total Purchase Value, Average Total Per Person]
Index: []

In [168]:
#  Top Spenders
top_spenders_sum = purchase_df.groupby("SN").sum()["Price"]
top_spenders_mean = purchase_df.groupby("SN").mean()["Price"]
top_spenders_count = purchase_df.groupby("SN").count()["Price"]
top_spenders_df = pd.DataFrame ({"Total Per Person":top_spenders_sum,"Average Price":top_spenders_mean,
                                 "Purchase Count":top_spenders_count})
top_spenders_df = top_spenders_df.sort_values("Total Per Person",ascending=False)
top_spenders_df

             Total Per Person  Average Price  Purchase Count
SN
Lisosia93               18.96       3.792000               5
Idastidru52             15.45       3.862500               4
Chamjask73              13.83       4.610000               3
Iral74                  13.62       3.405000               4
Iskadarya95             13.10       4.366667               3
...                       ...            ...             ...
Ililsasya43              1.02       1.020000               1
Irilis75                 1.02       1.020000               1
Aidai61                  1.01       1.010000               1
Chanirra79               1.01       1.010000               1
Alo38                    1.00       1.000000               1

[576 rows x 3 columns]

In [194]:
# Retrieve the Item ID, Item Name, and Item Price columns
Item_Info_df = purchase_df[["Item ID","Item Name","Price"]]
Item_Info_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [199]:
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value
total_purchase_sum = purchase_df.groupby(["Item ID","Item Name"]).sum()["Price"]
total_purchase_mean = purchase_df.groupby(["Item ID","Item Name"]).mean()["Price"]
total_purchase_count = purchase_df.groupby(["Item ID","Item Name"]).count()["Price"]
total_purchase_df = pd.DataFrame ({"Total Purchase Value":total_purchase_sum,"Item Price":total_purchase_mean,
                                 "Purchase Count":total_purchase_count})
total_purchase_df = total_purchase_df.sort_values("Purchase Count",ascending=False)
total_purchase_df

,,Total Purchase Value,Item Price,Purchase Count
Item ID,Item Name,,,
92,Final Critic,59.99,4.614615,13
178,"Oathbreaker, Last Hope of the Breaking Storm",50.76,4.230000,12
145,Fiery Glass Crusader,41.22,4.580000,9
132,Persuasion,28.99,3.221111,9
108,"Extraction, Quickblade Of Trembling Hands",31.77,3.530000,9
...,...,...,...,...
42,The Decapitator,1.75,1.750000,1
51,Endbringer,4.66,4.660000,1
118,"Ghost Reaver, Longsword of Magic",2.17,2.170000,1
104,Gladiator's Glaive,1.93,1.930000,1
91,Celeste,4.17,4.170000,1

In [ ]:
Sort the above table by total purchase value in descending order
Display a preview of the data frame

In [200]:
total_purchase_df = total_purchase_df.sort_values("Total Purchase Value",ascending=False)
total_purchase_df

,,Total Purchase Value,Item Price,Purchase Count
Item ID,Item Name,,,
92,Final Critic,59.99,4.614615,13
178,"Oathbreaker, Last Hope of the Breaking Storm",50.76,4.230000,12
82,Nirvana,44.10,4.900000,9
145,Fiery Glass Crusader,41.22,4.580000,9
103,Singed Scalpel,34.80,4.350000,8
...,...,...,...,...
28,"Flux, Destroyer of Due Diligence",2.12,1.060000,2
126,Exiled Mithril Longsword,2.00,2.000000,1
125,Whistling Mithril Warblade,2.00,1.000000,2
104,Gladiator's Glaive,1.93,1.930000,1
42,The Decapitator,1.75,1.750000,1